Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བྱི་དོར་གྱིས་ཤིག་དང་སྨྲའོ། །དེ་ནས་འདྲུ་ཞིང་དྲིས་པ། འཕགས་པ་སངས་རྒྱས་ཞེས་བགྱི་བ་འདི་ཅི་ལགས།
en: Then she asked while grinding the barley, “O noble one, what is the Buddha?”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བསམས་པ། གལ་ཏེ་འདི་ལ་བདག་གིས་སངས་རྒྱས་ཀྱི་བསྔགས་པ་བརྗོད་ན། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཟབ་པ་ཡིན་པས་འདིས་ཤེས་པར་མི་འགྱུར་བའི་གནས་གང་ཡིན་པ་དེ་ཡོད་ཀྱིས།
en: The venerable Ānanda thought, “Since the qualities of the Buddha are profound, it is likely that if I relate to her the praises of the Buddha, she will not be able to understand them.

source: མ་ལ་བདག་གིས་འདི་ལ་འཁོར་ལོས་སྒྱུར་བའི་བསྔགས་པ་བརྗོད་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་སྨྲས་པ། སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་རིན་པོ་ཆེ་སྣ་བདུན་ཡང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ།
en: Now I will relate to her the praises of a wheel-turning king.” He said, “Sister, if a wheel-turning king appears in the world, seven treasures appear in the world, too.

source: བདུན་པོ་དེ་དག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the seven?

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་ནི་བློན་པོ་རིན་པོ་ཆེ་ཡིན་ནོ།
en: They are the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་འཁོར་ལོ་རིན་པོ་ཆེ་ཇི་ལྟ་བུ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: “Sister, what is the precious chakra that appears in the world when a wheel-turning king appears in the world?

source: སྲིང་མོ་འདི་ལ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་གསོ་སྦྱོང་བཅྭ་ལྔ་པ་དེ་ཉིད་ལ་མགོ་ཁྲུས་བྱས་ཏེ་སྨྱུང་བ་བྱས་ནས། དེ་སྟེང་གི་ཁང་བཟངས་ཀྱི་གཞི་ལ་བློན་པོའི་ཚོགས་ཀྱིས་བསྐོར་ནས་འདུག་པ་ན། ཤར་ཕྱོགས་ནས་འཁོར་ལོ་རིན་པོ་ཆེ་ལྟེ་བ་དང་བཅས་པ།
en: Sister, here, when an anointed kṣatriya king, having washed his head and fasted on the day of poṣadha that is the fifteenth of the month, sits down on the terrace, surrounded by his ministers, the precious chakra appears from the east.

source: རྩིབས་སྟོང་དང་ལྡན་པ། མྱུ་ཁྱུད་དང་བཅས་པ། རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ། མཛེས་པ། མཁན་བཟོས་མ་བྱས་པ།
en: It consists of a hub, a thousand spokes, and a rim and is perfect in every respect, fair, not made by an artisan, but excellent, and made entirely of gold.

source: བཟང་པོ་ཐམས་ཅད་གསེར་ལས་བྱས་པ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་གང་ཡིན་པ་འདིས་གསོ་སྦྱོང་བཅྭ་ལྔ་པ་དེ་ཉིད་ཀྱི་ཚེ་ཞེས་བྱ་བ་ནས་ཐམས་ཅད་གསེར་ལས་བྱས་ཞེས་བྱ་བ་ནས་དེ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ་ཞེས་ཐོས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: This anointed kṣatriya king thinks, ‘I have heard that on the day of poṣadha that is the fifteenth of the month . . . made entirely of gold, he will be a wheel-turning king.

source: །བདག་ནི་གདོན་མི་ཟ་བར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏོ་སྙམ་ནས།
en: Certainly I have become a wheel-turning king.’

source: དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་བརྟག་པར་འདོད་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། འཁོར་ལོ་རིན་པོ་ཆེ་དེ་ལག་པ་གཉིས་ཀྱིས་བླངས་ནས་ལག་པ་གཡོན་པར་བཞག་སྟེ་ལག་པ་གཡས་པས་སྤོར་ཅིང་། ཀྱེ་འཁོར་ལོ་རིན་པོ་ཆེ་སྔོན་གྱི་འཁོར་ལོས་སྒྱུར་བ་འཕགས་པའི་ལམ་སྲོལ་གང་ཡིན་པར་རྣམ་པར་རྒྱལ་བར་གྱུར་ཅིག །རྣམ་པར་རྒྱལ་བར་གྱུར་ཅིག་ཅེས་སྨྲའོ།
en: “Then the wheel-turning king, wishing to examine the precious chakra, rises from his seat, puts his upper robe over one shoulder, kneels on his right knee, accepts the precious chakra with his hands, puts it on his left hand, and, raising it with his right hand, says, ‘O precious chakra, conquer, conquer through the noble path of wheel-turning kings of the past.’

source: །དེ་ནས་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་སྤར་བ་དང་། སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་ཤར་ཕྱོགས་སུ་སྔོན་གྱི་འཁོར་ལོས་སྒྱུར་བ་འཕགས་པའི་ལམ་སྲོལ་གང་ཡིན་པ་ནས་འགྲོ་བར་འགྱུར་རོ།
en: “Then the precious chakra, having been raised by the wheel-turning king, soars up into the air and heads off to the east, through the noble path of wheel-turning kings of the past.

source: །འཁོར་ལོ་རིན་པོ་ཆེ་དེའི་རྗེས་བཞིན་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྷན་ཅིག་ཏུ་འགྲོ་བར་འགྱུར་རོ།
en: Following the precious chakra, the wheel-turning king proceeds with his army consisting of four divisions.

source: །ཕྱོགས་གང་དུ་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་སྡོད་པ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྷན་ཅིག་གནས་འདེབས་པར་འགྱུར་ཞིང་།
en: Wherever the precious chakra stays, the wheel-turning king with his army consisting of four divisions builds residences there.

source: ཤར་ཕྱོགས་ཀྱི་ཁམས་ཀྱི་རྒྱལ་ཕྲན་གང་དག་ཡིན་པ་དེ་དག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་ལྷ་ཚུར་གཤེགས།
en: Those who are minor kings of the eastern region go to the wheel-turning king. When they arrive, they say to the wheel-turning king, ‘Come, Your Majesty.

source: ལྷ་བྱོན་པ་ལེགས་སོ།
en: Welcome, Your Majesty.

source: །ཡུལ་འཁོར་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་གང་ལགས་པ་འདི་ནི་ལྷའི་ལགས་ཀྱིས།
en: These countries, which are rich, prosperous, peaceful, abundant in food, and full of many people, are Your Majesty’s.

source: ལྷས་རྗེས་སུ་བསྐྱང་དུ་གསོལ།
en: May Your Majesty rule over them.

source: བདག་ཅག་ནི་ལྷའི་བཀའ་བཞིན་བགྱིད་པ་ལགས་སོ་ཞེས་སྨྲས་པ་དང་། དེའི་ཕྱིར་སྣ་བོ་དག་ཁྱེད་ཅག་རང་རང་གི་ཡུལ་འཁོར་ཆོས་ཀྱིས་རྗེས་སུ་བསྐྱང་བར་བྱའི་ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་ནོ།
en: We will do as Your Majesty orders.’ “He replies, ‘Then, lords, each of you should rule over each country lawfully, not unlawfully.

source: །འགའ་ཞིག་ཆོས་མ་ཡིན་པ་སྤྱོད་དམ་འདྲེན་མར་སྤྱོད་པ་ཞིག་ཡོད་ན།
en: If someone’s conduct is unlawful or a mixture of lawful and unlawful, you should not let him live in your country.

source: ཁྱེད་ཀྱིས་དེ་ཡུལ་འཁོར་དུ་མ་བཞག་ཅིག །དེ་ལྟ་ན་ཁྱེད་ཅག་ཁོ་བོའི་བཀའ་བཞིན་བྱེད་པ་ཡིན་ནོ།
en: In that way, you will be the ones who do as I order.’

source: །དེ་ནས་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་ཤར་ཕྱོགས་མངོན་པར་ཕབ་ནས་ཤར་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ནས་སླར་ལོག་སྟེ།
en: “Then the precious chakra, having conquered the eastern region, returns from the eastern great ocean.

source: ལྷོ་དང་། ནུབ་དང་། བྱང་ཕྱོགས་སུ་ཡང་སྔོན་གྱི་འཁོར་ལོས་སྒྱུར་བ་འཕགས་པའི་ལམ་སྲོལ་གང་ཡིན་པར་འགྲོ་བར་འགྱུར་བས།
en: It goes to the south, west, and north, through the noble path of wheel-turning kings of the past.

source: དེ་ནས་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་སྤར་བ་དང་། སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་བྱང་ཕྱོགས་སུ་སྔོན་གྱི་འཁོར་ལོས་སྒྱུར་བ་འཕགས་པའི་ལམ་སྲོལ་གང་ཡིན་པར་འགྲོ་བར་འགྱུར་རོ།
en: Then, having been raised by the wheel-turning king, it soars up into the air and goes to the north, through the noble path of wheel-turning kings of the past.

source: །འཁོར་ལོ་རིན་པོ་ཆེ་དེའི་རྗེས་བཞིན་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྷན་ཅིག་འགྲོ་བར་འགྱུར་རོ།
en: “Following the precious chakra, the wheel-turning king proceeds with his army consisting of four divisions.

source: །ཕྱོགས་གང་དུ་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་སྡོད་པ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྷན་ཅིག་གནས་འདེབས་པར་འགྱུར་ཞིང་།
en: Wherever the precious chakra stays, the wheel-turning king with his army consisting of four divisions builds residences there.

source: བྱང་ཕྱོགས་ཀྱི་ཁམས་ཀྱི་རྒྱལ་ཕྲན་གང་དག་ཡིན་པ་དེ་དག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་ལྷ་ཚུར་གཤེགས།
en: Those who are minor kings of the northern region go to the wheel-turning king. When they arrive, they say to the wheel-turning king, ‘Come, Your Majesty.

source: བདག་ཅག་ནི་ལྷའི་བཀའ་བཞིན་བགྱིད་པ་ལགས་སོ་ཞེས་སྨྲས་པ་དང་། དེའི་ཕྱིར་སྣ་བོ་དག་ཁྱེད་ཅག་རང་རང་གི་ཡུལ་རྣམས་ཆོས་ཀྱིས་རྗེས་སུ་བསྐྱང་བར་བྱའི་ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་ནོ། །འགའ་ཞིག་ཆོས་མ་ཡིན་པ་སྤྱོད་དམ།
en: We will do as Your Majesty orders.’ “He replies, ‘Then, lords, each of you should rule over each country lawfully, not unlawfully. If someone’s conduct is unlawful or a mixture of lawful and unlawful, you should not let him live in your country.

source: འདྲེན་མར་སྤྱོད་ན་ཁྱེད་ཀྱིས་ཡུལ་འཁོར་དུ་མ་བཞག་ཅིག །དེ་ལྟ་ན་ཁྱེད་ཅག་ཁོ་བོའི་བཀའ་བཞིན་བྱེད་པ་ཡིན་ནོ།
en: In that way, you will be the ones who do as I order.’

source: །དེ་ནས་འཁོར་ལོ་རིན་པོ་ཆེ་དེས་བྱང་ཕྱོགས་མངོན་པར་ཕབ་ནས་བྱང་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ནས་སླར་ལོག་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་དུ་ཕྱིན་ནས་དཀོར་ཁང་གི་སྟེང་དུ་སྲོག་ཤིང་བཙུགས་པ་བཞིན་དུ་གནས་སོ།
en: “Then the precious chakra, having conquered the northern region, returns from the northern great ocean and stays on top of the treasury, just as an axis is placed.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་འཁོར་ལོ་རིན་པོ་ཆེ་དེ་ལྟ་བུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: “Sister, if a wheel-turning king appears in the world, such a precious chakra appears in the world.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་གླང་པོ་རིན་པོ་ཆེ་ཇི་ལྟ་བུ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: “Sister, what is the precious elephant that appears in the world when a wheel-turning king appears in the world?

source: སྲིང་མོ་འདི་ལ་འཁོར་ལོས་སྒྱུར་བའི་གླང་པོ་ནི་ཐལ་ཀར་མེ་ཏོག་ཀུ་མུ་དའི་མདོག་ལྟ་བུ་ཡན་ལག་བདུན་ལེགས་པར་གནས་པ། གཟུགས་བཟང་བ།
en: “Sister, here the elephant of a wheel-turning king is white as the color of a kumuda flower, and the seven parts of its body are well supported.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ་ཡིན་ནོ།
en: It is well proportioned, attractive, and pleasant to behold.

source: །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་འདི་མཐོང་ན་སེམས་མངོན་པར་དད་པར་གྱུར་ནས། ཀྱེ་མའོ་གླང་པོ་རིན་པོ་ཆེ་བཟང་པོ་ཞིག་ཡིན་གྱིས་མྱུར་དུ་དུལ་བར་འགྱུར་བར་བྱའོ་སྙམ་ནས།
en: Having seen this, his mind filled with joy, the wheel-turning king thinks, ‘Ah, this precious elephant is good. I will have it trained quickly.’

source: དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་གླང་པོ་འདུལ་སྦྱོང་མཁན་མཁས་པ་ཕོ་ཉས་བཀུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེས་པ་ཁྱོད་ཀྱིས་གླང་པོ་རིན་པོ་ཆེ་འདི་མྱུར་བ་ཁོ་ནར་ལེགས་པར་དུལ་བར་བྱོས་ལ་ང་ལ་ཕུལ་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་གླང་པོ་འདུལ་སྦྱོང་མཁན་མཁས་པས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ལྟར་མཉན་ནས།
en: “Then the wheel-turning king summons a skillful elephant trainer by messenger and orders him, ‘O gentle sir, you should quickly train this precious elephant well and bring it to me.’

source: གླང་པོ་རིན་པོ་ཆེ་དེ་ལ་བསླབ་པ་ཐམས་ཅད་ཉིན་ཞག་གཅིག་ལ་སློབ་པར་བྱེད་དེ།
en: “ ‘Certainly, Your Majesty,’ replies the skillful elephant trainer to the wheel-turning king, and he trains the precious elephant in all kinds of ways for one day.

source: དེ་ལ་ཉིན་ཞག་གཅིག་ལ་བསླབ་པ་ཐམས་ཅད་སློབ་པ་ན་ཉིན་ཞག་གཅིག་གིས་བསླབ་པ་ཐམས་ཅད་ལོབས་པ་ནི་དཔེར་ན་གླང་པོ་ཆེ་གཞན་རྣམས་ལོ་དུ་མ་དང་། ལོ་ཁྱུད་སྐོར་དུ་མར་བསླབ་པ་ཐམས་ཅད་བསླབས་ནས་བསླབ་པ་ཐམས་ཅད་ལོབས་པ་དེ་བཞིན་དུ།
en: When he trains it in all kinds of ways for one day, it learns all of it in that very day.

source: གླང་པོ་རིན་པོ་ཆེ་དེ་ལ་ཉིན་ཞག་གཅིག་ལ་བསླབ་པ་ཐམས་ཅད་བསླབས་པ་ན་ཉིན་ཞག་གཅིག་གིས་བསླབ་པ་ཐམས་ཅད་ལོབས་སོ།
en: Just as other elephants learn all kinds of training only after being taught for many years, a great number of years, when the precious elephant is trained in all kinds of ways for just one day, it learns all of it in that very day.

source: །དེ་དུལ་བར་རིག་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་འབུལ་བར་བྱེད་དེ། ལྷ་གླང་པོ་རིན་པོ་ཆེ་བཟང་པོ་ནི་དུལ་ལགས་ཏེ།
en: Knowing it to have been well trained, he brings it to the wheel-turning king and says, ‘Your Majesty, the good, precious elephant has been trained.

source: ལྷ་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ། དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་གླང་པོ་རིན་པོ་ཆེ་དེ་བརྟག་པར་འདོད་ནས། ཉི་མ་འཆར་ཀའི་དུས་ཀྱི་ཚེ་གླང་པོ་རིན་པོ་ཆེ་དེ་ལ་ཞོན་ནས་རྒྱ་མཚོའི་མཐས་ཀླས་པའི་ས་ཆེན་པོ་བསྐོར་ཏེ། རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་དུ་ཕྱིན་པ་ན་ཞལ་ཚུས་ལ་འབབ་སྟེ།
en: May Your Majesty know it is the right time.’ Thereupon the wheel-turning king, wishing to examine the precious elephant, rides on the precious elephant at the time of sunrise, goes around the land as far as the seashore, and, having arrived at the very royal palace, has breakfast.

source: སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་གླང་པོ་རིན་པོ་ཆེ་དེ་ལྟ་བུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: “Sister, if a wheel-turning king appears in the world, such a precious elephant appears in the world.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་རྟ་རིན་པོ་ཆེ་ཇི་ལྟ་བུ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: “Sister, what is the precious horse that appears in the world when a wheel-turning king appears in the world?

source: སྲིང་མོ་འདི་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་རྟ་ནི་ཐམས་ཅད་སྔོ་བ་མགོ་གནག་ཅིང་རྔོག་མཇུག་སྡུག་པ། གཟུགས་བཟང་བ།
en: “Sister, here the horse of a wheel-turning king is entirely dark blue, with a black head and lovely mane and back.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ་ཡིན་ཏེ།
en: It is well proportioned, attractive, and pleasant to behold.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་དེ་མཐོང་ནས་སེམས་མངོན་པར་དད་པར་གྱུར་ནས། ཀྱེ་མ་རྟ་རིན་པོ་ཆེ་བཟང་པོ་ཞིག་ཡིན་གྱིས་མྱུར་དུ་དུལ་བར་འགྱུར་བར་བྱའོ་སྙམ་ནས།
en: When he sees it, his mind filled with joy, the wheel-turning king thinks, ‘Ah, this precious horse is good. I will have it trained quickly.’

source: དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་རྟ་མཁན་མཁས་པ་ཕོ་ཉས་བཀུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེས་པ་ཁྱོད་ཀྱིས་རྟ་རིན་པོ་ཆེ་འདི་མྱུར་བ་ཁོ་ནས་ལེགས་པར་དུལ་བར་བྱོས་ལ་ང་ལ་ཕུལ་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་རྟ་མཁན་མཁས་པས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལས་མཉན་ནས།
en: “Then the wheel-turning king summons a skillful horse trainer by messenger and orders him, ‘O gentle sir, you should quickly train this precious horse well and then bring it to me.’

source: རྟ་རིན་པོ་ཆེ་དེ་ལ་བསླབ་པ་ཐམས་ཅད་ཉིན་ཞག་གཅིག་ལ་སློབ་པར་བྱེད་དེ།
en: “ ‘Certainly, Your Majesty,’ replies the skillful horse trainer to the wheel-turning king, and he trains the precious horse in all kinds of ways for one day.

source: དེ་ལ་བསླབ་པ་ཐམས་ཅད་ཉིན་ཞག་གཅིག་ལ་སློབ་པ་ན།
en: When he trains it in all kinds of ways for just one day, it learns all of it in that very day.

source: ཉིན་ཞག་གཅིག་གིས་བསླབ་པ་ཐམས་ཅད་ལོབས་པ་ནི་དཔེར་ན་རྟ་གཞན་རྣམས་ལོ་དུ་མ་དང་། ལོ་ཁྱུད་སྐོར་དུ་མར་བསླབ་པ་ཐམས་ཅད་བསླབས་ནས་བསླབ་པ་ཐམས་ཅད་ལོབས་པ་དེ་བཞིན་དུ། རྟ་རིན་པོ་ཆེ་དེ་ལ་ཉིན་ཞག་གཅིག་ལ་བསླབ་པ་ཐམས་ཅད་སློབ་པ་ན་ཉིན་ཞག་གཅིག་གིས་བསླབ་པ་ཐམས་ཅད་ལོབས་སོ།
en: Just as other horses learn all kinds of training only after being taught for many years, a great number of years, when the precious horse is trained in all kinds of ways for just one day, it learns all of it in that very day.

source: །དེ་དུལ་བར་རིག་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་འབུལ་བར་བྱེད་དེ། ལྷ་རྟ་རིན་པོ་ཆེ་བཟང་པོ་ནི་དུལ་ལགས་ཏེ།
en: “Knowing it to have been well trained, he brings it to the wheel-turning king and says, ‘Your Majesty, the good, precious horse has been trained.

source: ལྷ་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ། དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་རྟ་རིན་པོ་ཆེ་བརྟག་པར་འདོད་ནས་ཉི་མ་འཆར་ཀའི་དུས་ཀྱི་ཚེ་རྟ་རིན་པོ་ཆེ་ལ་ཞོན་ནས་རྒྱ་མཚོའི་མཐས་ཀླས་པའི་ས་ཆེན་པོ་བསྐོར་ཏེ་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་དུ་ཕྱིན་པ་ན་ཞལ་ཚུས་ལ་འབབ་སྟེ།
en: May Your Majesty know it is the right time.’ Thereupon the wheel-turning king, wishing to examine the precious horse, rides on the precious horse at the time of sunrise, goes around the land as far as the seashore, and, having arrived at the royal palace, has breakfast.

source: སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་རྟ་རིན་པོ་ཆེ་དེ་ལྟ་བུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: “Sister, if a wheel-turning king appears in the world, such a precious horse appears in the world.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་ནོར་བུ་རིན་པོ་ཆེ་ཇི་ལྟ་བུ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: “Sister, what is the precious jewel that appears in the world when a wheel-turning king appears in the world?

source: སྲིང་མོ་འདི་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ནོར་བུ་ནི་ཟུར་བརྒྱད་ཡོད་པ། བཻ་ཌཱུརྱ་བཟང་པོའི་རིགས་ཅན། དང་བ།
en: “Sister, here the jewel of a wheel-turning king has eight sides and has its origin in excellent lapis lazuli.

source: གསལ་བ། རྣམ་པར་དང་བ་ཡིན་ཏེ།
en: It is pure, bright, and clear.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ཕོ་བྲང་ན་མེ་མར་གྱི་བྱ་བ་ཐམས་ཅད་ནོར་བུ་དེའི་འོད་ཀྱིས་བྱེད་དོ།
en: In the palace of the wheel-turning king all the functions of a lamp are performed by the light of that jewel.

source: །དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་ནོར་བུ་རིན་པོ་ཆེ་བརྟག་པར་འདོད་ནས་མུན་གནག་སྨག་ཏུ་གྱུར་ལ། ལྷས་མཚན་མོ་ཆར་གྱི་རྒྱུན་དལ་བུ་དལ་བུས་འབེབས་ཤིང་། གློག་འགྱུ་བའི་དུས་སུ་ནོར་བུ་རིན་པོ་ཆེ་དེ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཞག་ནས་སྐྱེད་མོས་ཚལ་གྱི་ནང་དུ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྷན་ཅིག་དོང་བ་ན།
en: Then, wishing to examine the precious jewel, the wheel-turning king goes to a park with an army consisting of four divisions, with the precious jewel placed on top of a banner when it is completely dark at night, it is raining slightly, and lightning flashes.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པོ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། རྒྱང་གྲགས་ཕྱེད་ཁོ་ར་ཁོར་ཡུག་ཏུ་ནོར་བུའི་འོད་ཀྱིས་གསལ་བར་འགྱུར་ཏེ།
en: The wheel-turning king’s entire army consisting of four divisions, and half a yojana around it, are then illuminated by the light of the jewel.

source: སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་ནོར་བུ་རིན་པོ་ཆེ་དེ་ལྟ་བུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: “Sister, if a wheel-turning king appears in the world, such a precious jewel appears in the world.

source: །སྲིང་མོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཇིག་རྟེན་དུ་བྱུང་ན་བཙུན་མོ་རིན་པོ་ཆེ་ཇི་ལྟ་བུ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: “Sister, what is the precious woman that appears in the world when a wheel-turning king appears in the world?

source: སྲིང་མོ་འདི་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཙུན་མོ་ནི་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཧ་ཅང་མི་དཀར་བ། ཧ་ཅང་མི་སྔོ་བ།
en: “Sister, here the queen of a wheel-turning king is well proportioned, attractive, and pleasant to behold.

source: ཉ་ཁར་བ་ལྟར་པགས་པ་འཇམ་པ། ཧ་ཅང་མི་རིང་བ། ཧ་ཅང་མི་ཐུང་བ། བོང་རན་པ། ཧ་ཅང་མི་སྦོམ་པ། ཧ་ཅང་མི་སྐེམ་པ།
en: Her skin is not excessively white or dark, nor is it colored like the madgura fish. She is not excessively tall or short, but well balanced in size, not excessively thin or fat or fleshy, but well proportioned in flesh.

source: ཧ་ཅང་མི་ཚོ་བ། ཤ་བྲེ་རན་པ་གང་ཡིན་པ་སྟེ། སྲིང་མོ་དེ་ནི་གྲང་བའི་ཚེ་ལུས་ལ་རེག་ན་དྲོ་བ། ཚ་བའི་ཚེ་ལུས་ལ་རེག་ན་བསིལ་བ། ཡུལ་ཀ་ལིང་ཀའི་གོས་ལྟར་རེག་ན་འཇམ་པའོ།
en: Sister, she is warm to the touch when it is cold, cool to the touch when it is hot, and as smooth to the touch as cloth from Kaliṅga.

source: །སྲིང་མོ་དེའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནི་ཙན་དན་གྱི་དྲི་འབྱུང་ངོ་།
en: Sister, from every pore of skin on her entire body the perfume of sandalwood issues forth.

source: །ཁ་ནས་ནི་ཨུཏྤ་ལ་སྔོན་པོའི་དྲི་འབྱུང་ངོ་།
en: From her mouth the perfume of the blue blossom of the utpala exudes.”

source: །ཇི་སྲིད་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཙུན་མོ་རིན་པོ་ཆེའི་བར་དུ་བཤད་པ་དེ་སྲིད་ཀྱིས་བུ་མོ་དེས་ཀྱང་ནས་ཀྱི་བྱ་བ་ཟིན་ནས། དེས་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨོན་ལམ་གདབ་པར་བརྩམས་པ།
en: While the venerable Ānanda explained as far as the precious woman, the woman finished cooking the barley.

source: འཕགས་པ་དགེ་བའི་རྩ་བ་འདིས་བདག་འཁོར་ལོས་སྒྱུར་བའི་བཙུན་མོ་རིན་པོ་ཆེར་གྱུར་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ནས་བྱི་དོར་བྱས་པ་ཁྱེར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ།
en: She threw herself at the venerable Ānanda’s feet and made an aspiration: “O noble one, by this root of merit, may I become the precious woman of a wheel-turning king.” Thereupon the venerable Ānanda went to the Blessed One, bringing the prepared barley. When he arrived, he offered it to the Blessed One.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ནས་འདི་སུ་ཞིག་གིས་བྱི་དོར་བྱས།
en: The Buddha, the Blessed One, asked the venerable Ānanda, “Ānanda, who prepared this barley?”

source: བཙུན་པ་བྲམ་ཟེའི་བུ་མོ་ཆེ་གེ་མོ་ཞིག་གིས་བགྱིས་ལགས་སོ།
en: “O Honored One, the brahmin’s daughter So-and-so did.”

source: །ཀུན་དགའ་བོ་ཁྱོད་བྲམ་ཟེའི་བུ་མོ་དེ་དང་ལྷན་ཅིག་སྐབས་ཀྱི་གཏམ་དག་བྱས་སམ།
en: “Ānanda, did you have a conversation with her?”

source: བཅོམ་ལྡན་འདས་བགྱིས་ལགས་སོ།
en: “Yes, I did, O Honored One.”

source: །ཀུན་དགའ་བོ་དེས་ན་ཁྱོད་བྲམ་ཟེའི་བུ་མོ་དེ་དང་ལྷན་ཅིག་སྐབས་ཀྱི་གཏམ་ཇི་སྙེད་བྱས་པ་དེ་དག་ཐམས་ཅད་ང་ལ་རྒྱས་པར་གསོལ་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བྲམ་ཟེའི་བུ་མོ་དང་ལྷན་ཅིག་སྐབས་ཀྱི་གཏམ་ཇི་སྙེད་བྱས་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་རྒྱས་པར་གསོལ་ཏོ།
en: “Ānanda, then tell me in detail all about the talk you had with the brahmin’s daughter.” The venerable Ānanda then told the Blessed One in detail all about the talk he had had with the brahmin’s daughter.

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཅིའི་ཕྱིར་བུ་མོ་དེ་ལ་སངས་རྒྱས་ཀྱི་བསྔགས་པ་མ་བརྗོད།
en: When the venerable Ānanda had thus spoken, the Blessed One said to him, “Ānanda, why did you not relate to the girl the praises of the Buddha?”

source: བཙུན་པ་བདག་གིས་འདི་སྙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ནི་ཟབ་པ་ལགས་པས་བུ་མོ་འདིས་རྟོགས་པར་མི་འགྱུར་བ་གང་ལགས་པའི་གནས་དེ་མཆིས་སོ་སྙམ་དུ་བསམས་ནས། དེའི་སླད་དུ་བདག་གིས་དེ་ལ་འཁོར་ལོས་སྒྱུར་བའི་བསྔགས་པ་བརྗོད་ལགས་སོ།
en: “O Honored One, I thought, ‘Since the qualities of the Buddha are profound, it is likely that she will not be able to understand them.’ Therefore, I told her the praises of a wheel-turning king.”

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མ་ལེགས་པ་ཞིག་བྱས་ཏེ།
en: “Ānanda, it wasn’t good that you did that.

source: ཁྱོད་ཀྱིས་གལ་ཏེ་དེ་ལ་སངས་རྒྱས་ཀྱི་བསྔགས་པ་བརྗོད་པ་བྱས་ན། དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པར་འགྱུར་བ་གང་ཡིན་པའི་གནས་དེ་ཡོད་པ་ཞིག །ཀུན་དགའ་བོ་འོན་ཀྱང་བུ་མོ་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཙུན་མོ་རིན་པོ་ཆེར་འགྱུར་རོ།
en: It is likely that if you had related to her the praises of the Buddha, she would have made a resolution to attain complete and supreme awakening without regression. Now, however, Ānanda, this girl will become the precious woman of a wheel-turning king.”

source: །ཀུན་དུ་བྲམ་ཟེའི་བུ་མོ་ཆེ་གེ་མོ་ཞིག་བཅོམ་ལྡན་འདས་ཀྱི་དོན་དུ་ནས་བྱི་དོར་བྱས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཙུན་མོ་རིན་པོ་ཆེར་ལུང་བསྟན་ཏོ་ཞེས་སྒྲ་གྲགས་པ་དག་བུ་མོ་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་ཞིག་གིས་ཐོས་ནས། དགེ་སློང་ལྔ་བརྒྱར་དགེ་སློང་གཉིས་ཀྱིས་མ་ཚང་བ་རྣམས་ཀྱི་ནས་བྱི་དོར་བྱས་ཏེ།
en: Then there was a loud shout: “The brahmin’s daughter So-and-so prepared barley for the Blessed One. The Blessed One predicted her to become the precious woman of a wheel-turning king!” When they heard this, four hundred ninety-eight girls prepared barley for the four hundred ninety-eight monks.

source: དེ་རྣམས་ཀྱིས་ཀྱང་སྨོན་ལམ་བཏབ་པ། བདག་ཅག་དེའི་འཁོར་དུ་གྱུར་ཅིག །ཇི་ཙམ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་ནས་ཀྱི་བཤོས་གསོལ་བར་བརྩམས་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ཡི་མུག་ནས།
en: They made an aspiration, too: “May we become her attendants!”

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ཚེ་བརྒྱུད་པ་དེ་དང་དེ་རྣམས་སུ་ཕྱག་དང་། ཞབས་དང་། དབུ་ལ་སོགས་པ་བཅད་ཅིང་སྦྱིན་པ་བཏང་ནས་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་པ་དེ་ད་ནི་ནས་རུལ་པའི་བཤོས་གསོལ་བ་ལྟ་ཞེས་མཆི་མ་དབྱུང་བར་བརྩམས་སོ།
en: When the Blessed One started to eat the meal of barley, the venerable Ānanda became sad and shed tears, thinking, “The Blessed One, who has made donations by cutting off his hands, feet, and head during such-and-such lives and has attained the state of knowing everything after three incalculably long eons, is now having a meal of rotten barley!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཅིའི་ཕྱིར་མི་དགའ་ཞིང་མཆི་མ་གློག །བཙུན་པ་བཅོམ་ལྡན་འདས་འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་འཁྲུངས་ན་རྒྱལ་སྲིད་སྤངས་ནས་རབ་ཏུ་བྱུང་སྟེ། ཕྱག་དང་། ཞབས་དང་། དབུ་ལ་སོགས་པ་བཀུམ་ཞིང་སྦྱིན་པ་བཏང་ནས་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་བརྙེས་པ་དེ་ད་ནི་སྩང་ནས་རུལ་པའི་བཤོས་གསོལ་བ་ལྟ་སྙམ་བགྱིད་ལགས་མོད།
en: Then the Blessed One asked the venerable Ānanda, “Ānanda, why are you not pleased but shedding tears?” “O Honored One, I thought, ‘The Blessed One, who was born in the family of wheel-turning kings and has abandoned the throne and gone forth, who has given donations by cutting off his hands, feet, head, and so on during such-and-such lives and has attained the state of knowing everything after three incalculably long eons, is now having a meal of rotten barley!’ ”
